Revit 2027 API
BuiltInFailures.ScheduleViewFailures.NotGridName Property
 '[Text]' is not a Grid line name
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotGridName { get; }
Public Shared ReadOnly Property NotGridName As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotGridName {
	FailureDefinitionId^ get ();
}
static member NotGridName : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ScheduleViewFailures Class
Autodesk.Revit.DB Namespace